# Создать программу которая берет любой текстовый инпут и переделывает текст в код Морза

#функция которая содержит азбуку морезе

MorseCode= {'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.', 'G': '--.', 'H': '....',
'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.', 'O': '---', 'P': '.--.','Q': '--.-', 'R': '.-.', 'S': '...',
'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-','Y': '-.--', 'Z': '--..'}

#функция которая создаёт инпут

user_input = input("Введите текст для перевода в азбуку Морзе: ")

#функция которая переводит текст в азбуку морзе
# (каюсь тут не смог сам сделать и использовал ChatGPT)

def text_to_morse(text):
    morse_code = ''
    for char in text:
        if char.upper() in morse_code_dict:
            morse_code += morse_code_dict[char.upper()] + ' '
        elif char == ' ':
            morse_code += ' '
    return morse_code.strip()
